Revit 2026 API

# CableTrayShape Enumeration

---

Shape types enum of cable tray

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum CableTrayShape
```
```vb
Public Enumeration CableTrayShape
```
```cpp
public enum class CableTrayShape
```
```fsharp
type CableTrayShape
```

| Member name | Value | Description |
| --- | --- | --- |
| Channel | 1 | Channel cable tray shape. |
| Invalid | 0 | Invalid cable tray shape. |
| Ladder | 2 | Ladder cable tray shape. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace